Autodesk.Navisworks.Api.Progress
Used to report progress of lengthy operations

Autodesk.Navisworks.Api.Progress.BeginSubOperation(System.Double)
Starts a sub operation. Progress in sub op between 0 and 1 maps to fraction of remaining time in main operation. Can be nested.
fractionOfRemainingTime: Fraction of remaining time this sub operation will take, between 0 and 1
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.BeginSubOperation(System.Double,System.String)
Starts a sub operation. Progress in sub op between 0 and 1 maps to fraction of remaining time in main operation. Can be nested.
fractionOfRemainingTime: Fraction of remaining time this sub operation will take, between 0 and 1
message: User message to display for this sub operation.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.Cancel
Forces operation to cancel next time Autodesk.Navisworks.Api.Progress.Update(System.Double) is called
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.EndSubOperation
Ends the current sub operation. It may have either fully completed or ended early.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.EndSubOperation(System.Boolean)
Ends the current sub operation. It may have either fully completed or ended early.
completed: States whether the sub operation completed or not.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.Hide
Hide the progress if it is a dialog and it needs to get out of the way of another window that is about to open.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.IsCanceled
Determines if the operation is cancelled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Progress.ReportError(System.Int32)
Report an error immediately to the user.
errorCode: Application/operation-defined error code.
Returns: false if user wants to cancel operation, true if they want to ignore and continue.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.ReportError(System.Int32,System.String)
Report an error immediately to the user.
errorCode: Application/operation-defined error code.
message: User error message.
Returns: false if user wants to cancel operation, true if they want to ignore and continue.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.ReportError(System.Int32,System.String,System.Boolean)
Report an error immediately to the user.
errorCode: Application/operation-defined error code.
message: User error message.
isFileError: Is the error related to the current working filename ?
Returns: false if user wants to cancel operation, true if they want to ignore and continue.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.Show
Show the progress if it is a dialog and was previously hidden.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.Update(System.Double)
Updates progress on the current operation or sub-operation
fractionDone: Fraction of operation or sub-operation completed, between 0 and 1
Returns: false if user wants to cancel operation, true if they want to continue.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Progress.WorkingFileName
The working filename. Set if multiple files are being processed in this operation to give more detailed information.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only